{
  "experience": "Experience",
  "role-GoBuid": "前端工程師",
  "period-GoBuid": "2025-05 - Now",
  "company-GoBuid": "GoBuid",
  "description-GoBuid-1": "Designed and implemented a step-based onboarding system with homepage progress tracking and cross-page guided workflows. Used Redux to manage onboarding state and navigation between steps, helping new users quickly adopt core features. This initiative increased new user retention by approximately 20%, based on metrics confirmed with the sales team.",
  "description-GoBuid-2": "Refactored legacy frontend code with high coupling and poor maintainability by restructuring component architecture and extracting complex business logic into custom React Hooks. Applied clear design criteria based on state complexity and code size to improve readability, maintainability, and overall development efficiency.",
  "description-GoBuid-3": "Established a Playwright E2E testing foundation by encapsulating common page interactions into reusable utilities and implementing core happy-path test cases, improving test maintainability and providing a scalable base for future test expansion.",
  "description-GoBuid-4": "Designed and implemented a no-code reporting tool that enables users to configure reports and create custom templates without writing any code.The system supports template generation and management, and can reliably render 100+ components simultaneously.Optimized the front-end rendering workflow to maintain UI responsiveness during report navigation, improving overall system stability and user experience.",
  "role-inteware": "Software Engineer",
  "period-inteware": "2024-10 - 2025-05",
  "company-inteware": "Inteware",
  "description-inteware-1": "Implemented a frontend queue mechanism to handle high-concurrency batch uploads (500+ items), effectively resolving race conditions and improving system stability and user experience.",
  "description-inteware-2": "Addressed performance bottlenecks in 3D model rendering by introducing Web Workers to offload heavy computations to background threads, significantly reducing main thread blocking and improving loading smoothness.",
  "description-inteware-3": "Introduced Zustand to simplify state management logic, reducing boilerplate code and improving development efficiency and long-term maintainability.",
  "role-intern": "Software Engineer Intern",
  "period-intern": "2022 Feb - 2022 Sep",
  "company-intern": "聖瑋科技工作室",
  "description-intern-1": "Optimized the ordering app, added additional options (such as adding chili) and history order query functions, reducing the ordering process time by 50%.",
  "description-intern-2": "Optimized the shopping website's container, tab, and header switching functions, achieving dynamic content display height adjustment, reducing the complexity of calculating displayed content, and reducing the user loading page time by 20%.",
  "description-intern-3": "Used the Cypress automated testing framework to test the processes of adding items to the cart and checking out, reducing the testing time by 80%.",
  "education": "Education",
  "degree-master": "Master of Department of Computer Science and Information Engineering",
  "period-master": "2023 Feb - 2025 Jan",
  "school-master": "National Taichung University of Science and Technology",
  "award": "Awards",
  "award-1-name": "Third Place in Northern Taiwan GDSC Hackathon",
  "award-1-period": "2021"
}
